I'm still working on getting the acceptance test to pass, but if anyone has any input on changes to make to help it along I would greatly appreciate it. Current output is: 
`==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./internal/service/sagemaker/... -v -count 1 -parallel 20 -run='TestAccSageMakerModelQualityJobDefinition'  -timeout 180m
=== RUN   TestAccSageMakerModelQualityJobDefinition_endpoint
=== PAUSE TestAccSageMakerModelQualityJobDefinition_endpoint
=== RUN   TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_baselineConfig
=== PAUSE TestAccSageMakerModelQualityJobDefinition_baselineConfig
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransform
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransform
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_endpointOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_endpointOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
=== PAUSE TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
=== RUN   TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
=== PAUSE TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
=== RUN   TestAccSageMakerModelQualityJobDefinition_stoppingCondition
=== PAUSE TestAccSageMakerModelQualityJobDefinition_stoppingCondition
=== RUN   TestAccSageMakerModelQualityJobDefinition_networkConfig
=== PAUSE TestAccSageMakerModelQualityJobDefinition_networkConfig
=== RUN   TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
=== PAUSE TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
=== RUN   TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
=== PAUSE TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
=== RUN   TestAccSageMakerModelQualityJobDefinition_tags
=== PAUSE TestAccSageMakerModelQualityJobDefinition_tags
=== RUN   TestAccSageMakerModelQualityJobDefinition_disappears
=== PAUSE TestAccSageMakerModelQualityJobDefinition_disappears
=== CONT  TestAccSageMakerModelQualityJobDefinition_endpoint
=== CONT  TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
=== CONT  TestAccSageMakerModelQualityJobDefinition_endpointOptional
=== CONT  TestAccSageMakerModelQualityJobDefinition_disappears
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
=== CONT  TestAccSageMakerModelQualityJobDefinition_tags
=== CONT  TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransform
=== CONT  TestAccSageMakerModelQualityJobDefinition_stoppingCondition
=== CONT  TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
=== CONT  TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
=== CONT  TestAccSageMakerModelQualityJobDefinition_networkConfig
=== CONT  TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
=== CONT  TestAccSageMakerModelQualityJobDefinition_baselineConfig
=== CONT  TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
=== NAME  TestAccSageMakerModelQualityJobDefinition_stoppingCondition
    model_quality_job_definition_test.go:451: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-3777610564495201040): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: 4f9be69d-8fbb-4571-b9ec-d62c26891bb3

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 56, in resource "aws_sagemaker_model_quality_job_definition" "test":
          56: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_tags
    model_quality_job_definition_test.go:565: Step 1/4 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-7269424676271752552): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: b6f61f49-5b7b-41e1-819f-275ca0979288

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 56, in resource "aws_sagemaker_model_quality_job_definition" "test":
          56: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
    model_quality_job_definition_test.go:186: Step 1/2 error: Check failed: Check 4/11 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.csv.#' not found
=== NAME  TestAccSageMakerModelQualityJobDefinition_baselineConfig
    model_quality_job_definition_test.go:117: Step 1/2 error: Check failed: Check 6/7 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_baseline_config.0.statistics_resource.#' expected "1", got "0"
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
    model_quality_job_definition_test.go:257: Step 1/2 error: Check failed: Check 6/13 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.json.#' not found
--- FAIL: TestAccSageMakerModelQualityJobDefinition_tags (28.83s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_stoppingCondition (28.88s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader (30.65s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_baselineConfig (30.79s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine (31.10s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
    model_quality_job_definition_test.go:391: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-2817578916903504729): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityJobInputs.BatchTransformInput.InferenceAttribute.

        	status code: 400, request id: 5f109cdb-f166-4c7e-a390-285633b0dd81

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 56, in resource "aws_sagemaker_model_quality_job_definition" "test":
          56: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
    model_quality_job_definition_test.go:363: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-8687382437816244730): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityJobInputs.BatchTransformInput.InferenceAttribute.

        	status code: 400, request id: faaffc23-5dda-479a-bf17-0d6022d4142b

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 61, in resource "aws_sagemaker_model_quality_job_definition" "test":
          61: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
    model_quality_job_definition_test.go:509: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-808171804055484414): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: a3814eed-45ce-45c4-ad4e-f936f8364552

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 96, in resource "aws_sagemaker_model_quality_job_definition" "test":
          96: resource "aws_sagemaker_model_quality_job_definition" "test" {

--- FAIL: TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID (34.44s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_outputConfigOptional (34.55s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_networkConfig
    model_quality_job_definition_test.go:479: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-557394458785585219): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: 298ad74b-f8fa-4e36-b517-a1bae4049cb2

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 96, in resource "aws_sagemaker_model_quality_job_definition" "test":
          96: resource "aws_sagemaker_model_quality_job_definition" "test" {

--- FAIL: TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption (37.11s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_networkConfig (37.97s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransform
    model_quality_job_definition_test.go:149: Step 1/2 error: Check failed: Check 6/12 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.csv.#' not found
--- PASS: TestAccSageMakerModelQualityJobDefinition_disappears (38.47s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
    model_quality_job_definition_test.go:222: Step 1/2 error: Check failed: Check 4/10 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.json.#' not found
=== NAME  TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
    model_quality_job_definition_test.go:537: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-4481050380790009113): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityJobInputs.BatchTransformInput.InferenceAttribute.

        	status code: 400, request id: 47c3345a-ef62-42fb-8c8f-ba53800976df

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 96, in resource "aws_sagemaker_model_quality_job_definition" "test":
          96: resource "aws_sagemaker_model_quality_job_definition" "test" {

--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransform (41.14s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
    model_quality_job_definition_test.go:84: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:


        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement

        Terraform will perform the following actions:

          # aws_sagemaker_model_quality_job_definition.test must be replaced
        -/+ resource "aws_sagemaker_model_quality_job_definition" "test" {
              ~ arn      = "arn:aws:sagemaker:us-east-1:086420938595:model-quality-job-definition/tf-acc-test-1577639607078449599" -> (known after apply)
              ~ id       = "tf-acc-test-1577639607078449599" -> (known after apply)
                name     = "tf-acc-test-1577639607078449599"
              ~ tags_all = {} -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ job_resources {
                  ~ cluster_config {
                        # (3 unchanged attributes hidden)
                    }
                }


              ~ model_quality_job_input {
                  ~ batch_transform_input {
                      + features_attribute               = (known after apply)
                      ~ s3_data_distribution_type        = "FullyReplicated" -> (known after apply)
                      ~ s3_input_mode                    = "File" -> (known after apply)
                        # (7 unchanged attributes hidden)

                      + dataset_format { # forces replacement
                          + csv { # forces replacement}
                        }
                    }

                    # (1 unchanged block hidden)
                }

              ~ model_quality_job_output_config {
                  ~ monitoring_outputs {
                      ~ s3_output {
                          ~ s3_upload_mode = "EndOfJob" -> (known after apply)
                            # (2 unchanged attributes hidden)
                        }
                    }
                }

              ~ stopping_condition {
                  ~ max_runtime_in_seconds = 3600 -> (known after apply)
                }
                # (1 unchanged block hidden)
            }

        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformJSON (41.41s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation (42.75s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional (43.84s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
    model_quality_job_definition_test.go:422: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-8221165705076448114): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: 2cd566e8-0e81-46d5-a5eb-24b9afb93643

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 61, in resource "aws_sagemaker_model_quality_job_definition" "test":
          61: resource "aws_sagemaker_model_quality_job_definition" "test" {

--- FAIL: TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID (51.51s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
    model_quality_job_definition_test.go:295: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:


        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement

        Terraform will perform the following actions:

          # aws_sagemaker_model_quality_job_definition.test must be replaced
        -/+ resource "aws_sagemaker_model_quality_job_definition" "test" {
              ~ arn      = "arn:aws:sagemaker:us-east-1:086420938595:model-quality-job-definition/tf-acc-test-4973670846617786490" -> (known after apply)
              ~ id       = "tf-acc-test-4973670846617786490" -> (known after apply)
                name     = "tf-acc-test-4973670846617786490"
              ~ tags_all = {} -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ job_resources {
                  ~ cluster_config {
                        # (3 unchanged attributes hidden)
                    }
                }

              ~ model_quality_app_specification {
                    # (2 unchanged attributes hidden)
                }

              ~ model_quality_job_input {
                  ~ batch_transform_input {
                      + features_attribute               = (known after apply)
                        # (9 unchanged attributes hidden)

                      + dataset_format { # forces replacement
                          + csv { # forces replacement}
                        }
                    }

                    # (1 unchanged block hidden)
                }

              ~ model_quality_job_output_config {
                  ~ monitoring_outputs {
                      ~ s3_output {
                          ~ s3_upload_mode = "EndOfJob" -> (known after apply)
                            # (2 unchanged attributes hidden)
                        }
                    }
                }

              ~ stopping_condition {
                  ~ max_runtime_in_seconds = 3600 -> (known after apply)
                }
            }

        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformOptional (57.21s)
^CFAIL	github.com/hashicorp/terraform-provider-aws/internal/service/sagemaker	198.735s
FAIL
make: *** [testacc] Error 1

nicholasmcelroy@Nicholass-MacBook-Pro terraform-provider-aws % make testacc TESTS=TestAccSageMakerModelQualityJobDefinition PKG=sagemaker
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./internal/service/sagemaker/... -v -count 1 -parallel 20 -run='TestAccSageMakerModelQualityJobDefinition'  -timeout 180m
=== RUN   TestAccSageMakerModelQualityJobDefinition_endpoint
=== PAUSE TestAccSageMakerModelQualityJobDefinition_endpoint
=== RUN   TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_baselineConfig
=== PAUSE TestAccSageMakerModelQualityJobDefinition_baselineConfig
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransform
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransform
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
=== RUN   TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_endpointOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_endpointOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
=== PAUSE TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
=== RUN   TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
=== PAUSE TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
=== RUN   TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
=== PAUSE TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
=== RUN   TestAccSageMakerModelQualityJobDefinition_stoppingCondition
=== PAUSE TestAccSageMakerModelQualityJobDefinition_stoppingCondition
=== RUN   TestAccSageMakerModelQualityJobDefinition_networkConfig
=== PAUSE TestAccSageMakerModelQualityJobDefinition_networkConfig
=== RUN   TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
=== PAUSE TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
=== RUN   TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
=== PAUSE TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
=== RUN   TestAccSageMakerModelQualityJobDefinition_tags
=== PAUSE TestAccSageMakerModelQualityJobDefinition_tags
=== RUN   TestAccSageMakerModelQualityJobDefinition_disappears
=== PAUSE TestAccSageMakerModelQualityJobDefinition_disappears
=== CONT  TestAccSageMakerModelQualityJobDefinition_endpoint
=== CONT  TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
=== CONT  TestAccSageMakerModelQualityJobDefinition_disappears
=== CONT  TestAccSageMakerModelQualityJobDefinition_tags
=== CONT  TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
=== CONT  TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
=== CONT  TestAccSageMakerModelQualityJobDefinition_networkConfig
=== CONT  TestAccSageMakerModelQualityJobDefinition_stoppingCondition
=== CONT  TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
=== CONT  TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
=== CONT  TestAccSageMakerModelQualityJobDefinition_endpointOptional
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransform
=== CONT  TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
=== CONT  TestAccSageMakerModelQualityJobDefinition_baselineConfig
=== CONT  TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
=== NAME  TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID
    model_quality_job_definition_test.go:422: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-1878207328919615465): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: d24a9caf-1f62-4928-8e62-f56a0ee02e72

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 61, in resource "aws_sagemaker_model_quality_job_definition" "test":
          61: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID
    model_quality_job_definition_test.go:363: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-7870527867763560684): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityJobInputs.BatchTransformInput.InferenceAttribute.

        	status code: 400, request id: fd085318-11c0-456e-b8fa-09d2800e6ffb

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 61, in resource "aws_sagemaker_model_quality_job_definition" "test":
          61: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader
    model_quality_job_definition_test.go:186: Step 1/2 error: Check failed: Check 4/11 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.csv.#' not found
--- FAIL: TestAccSageMakerModelQualityJobDefinition_jobResourcesVolumeKMSKeyID (28.11s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_stoppingCondition
    model_quality_job_definition_test.go:451: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-3899887494404357661): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: 5df58ece-8d08-4562-805c-f14f1a6cd48e

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 56, in resource "aws_sagemaker_model_quality_job_definition" "test":
          56: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_networkConfig
    model_quality_job_definition_test.go:479: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-5206442178373491905): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: 9fea1d5b-77eb-4c4a-9b59-135e417eada3

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 96, in resource "aws_sagemaker_model_quality_job_definition" "test":
          96: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation
    model_quality_job_definition_test.go:537: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-8031961214748462187): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityJobInputs.BatchTransformInput.InferenceAttribute.

        	status code: 400, request id: 1fae0baf-1a6d-4899-8733-fced2f5288fd

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 96, in resource "aws_sagemaker_model_quality_job_definition" "test":
          96: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption
    model_quality_job_definition_test.go:509: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-4544612010116254757): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: dd066143-fb8e-4e6e-8c7c-8ef33930f22e

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 96, in resource "aws_sagemaker_model_quality_job_definition" "test":
          96: resource "aws_sagemaker_model_quality_job_definition" "test" {

=== NAME  TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional
    model_quality_job_definition_test.go:84: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:


        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement

        Terraform will perform the following actions:

          # aws_sagemaker_model_quality_job_definition.test must be replaced
        -/+ resource "aws_sagemaker_model_quality_job_definition" "test" {
              ~ arn      = "arn:aws:sagemaker:us-east-1:086420938595:model-quality-job-definition/tf-acc-test-3716289293757547528" -> (known after apply)
              ~ id       = "tf-acc-test-3716289293757547528" -> (known after apply)
                name     = "tf-acc-test-3716289293757547528"
              ~ tags_all = {} -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ job_resources {
                  ~ cluster_config {
                        # (3 unchanged attributes hidden)
                    }
                }


              ~ model_quality_job_input {
                  ~ batch_transform_input {
                      ~ s3_data_distribution_type        = "FullyReplicated" -> (known after apply)
                      ~ s3_input_mode                    = "File" -> (known after apply)
                        # (8 unchanged attributes hidden)

                      + dataset_format { # forces replacement
                          + csv { # forces replacement}
                        }
                    }

                    # (1 unchanged block hidden)
                }

              ~ model_quality_job_output_config {
                  ~ monitoring_outputs {
                      ~ s3_output {
                          ~ s3_upload_mode = "EndOfJob" -> (known after apply)
                            # (2 unchanged attributes hidden)
                        }
                    }
                }

              ~ stopping_condition {
                  ~ max_runtime_in_seconds = 3600 -> (known after apply)
                }
                # (1 unchanged block hidden)
            }

        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccSageMakerModelQualityJobDefinition_outputConfigKMSKeyID (29.36s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformJSON
    model_quality_job_definition_test.go:222: Step 1/2 error: Check failed: Check 4/10 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.json.#' not found
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformCSVHeader (30.48s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_stoppingCondition (33.21s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_appSpecificationOptional (33.69s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_networkConfigTrafficEncryption (34.06s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_networkConfigEnableNetworkIsolation (34.17s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_networkConfig (34.17s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformJSON (35.08s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_tags
    model_quality_job_definition_test.go:565: Step 1/4 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-8733416032810874101): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityAppSpecification.ProblemType.

        	status code: 400, request id: 76d52c2e-5efe-497e-9608-a4bf41a96429

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 56, in resource "aws_sagemaker_model_quality_job_definition" "test":
          56: resource "aws_sagemaker_model_quality_job_definition" "test" {

--- FAIL: TestAccSageMakerModelQualityJobDefinition_tags (40.05s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_baselineConfig
    model_quality_job_definition_test.go:117: Step 1/2 error: Check failed: Check 6/7 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_baseline_config.0.statistics_resource.#' expected "1", got "0"
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine
    model_quality_job_definition_test.go:257: Step 1/2 error: Check failed: Check 6/13 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.json.#' not found
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransform
    model_quality_job_definition_test.go:149: Step 1/2 error: Check failed: Check 6/12 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'model_quality_job_input.0.batch_transform_input.0.dataset_format.0.csv.#' not found
--- FAIL: TestAccSageMakerModelQualityJobDefinition_baselineConfig (43.65s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_batchTransformOptional
    model_quality_job_definition_test.go:295: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:


        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement

        Terraform will perform the following actions:

          # aws_sagemaker_model_quality_job_definition.test must be replaced
        -/+ resource "aws_sagemaker_model_quality_job_definition" "test" {
              ~ arn      = "arn:aws:sagemaker:us-east-1:086420938595:model-quality-job-definition/tf-acc-test-3237578747284011060" -> (known after apply)
              ~ id       = "tf-acc-test-3237578747284011060" -> (known after apply)
                name     = "tf-acc-test-3237578747284011060"
              ~ tags_all = {} -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ job_resources {
                  ~ cluster_config {
                        # (3 unchanged attributes hidden)
                    }
                }

              ~ model_quality_app_specification {
                    # (2 unchanged attributes hidden)
                }

              ~ model_quality_job_input {
                  ~ batch_transform_input {
                        # (10 unchanged attributes hidden)

                      + dataset_format { # forces replacement
                          + csv { # forces replacement}
                        }
                    }

                    # (1 unchanged block hidden)
                }

              ~ model_quality_job_output_config {
                  ~ monitoring_outputs {
                      ~ s3_output {
                          ~ s3_upload_mode = "EndOfJob" -> (known after apply)
                            # (2 unchanged attributes hidden)
                        }
                    }
                }

              ~ stopping_condition {
                  ~ max_runtime_in_seconds = 3600 -> (known after apply)
                }
            }

        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransform (44.19s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformJSONLine (47.52s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_batchTransformOptional (47.52s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_outputConfigOptional
    model_quality_job_definition_test.go:391: Step 1/2 error: Error running apply: exit status 1

        Error: creating SageMaker Model Quality Job Definition (tf-acc-test-3036102900646191742): ValidationException: InvalidParameter: 1 validation error(s) found.
        - missing required field, CreateModelQualityJobDefinitionInput.ModelQualityJobInputs.BatchTransformInput.InferenceAttribute.

        	status code: 400, request id: 478fc147-747b-4331-9bf8-ec319c9319d9

          with aws_sagemaker_model_quality_job_definition.test,
          on terraform_plugin_test.tf line 56, in resource "aws_sagemaker_model_quality_job_definition" "test":
          56: resource "aws_sagemaker_model_quality_job_definition" "test" {

--- PASS: TestAccSageMakerModelQualityJobDefinition_disappears (51.36s)
--- FAIL: TestAccSageMakerModelQualityJobDefinition_outputConfigOptional (51.57s)
=== NAME  TestAccSageMakerModelQualityJobDefinition_endpoint
    model_quality_job_definition_test.go:24: Step 1/2 error: Check failed: Check 3/35 error: aws_sagemaker_model_quality_job_definition.test: Attribute 'arn' expected "arn:aws:sagemaker:us-west-2:086420938595:model-quality-job-definition/tf-acc-test-944480912193189873", got "arn:aws:sagemaker:us-east-1:086420938595:model-quality-job-definition/tf-acc-test-944480912193189873"
--- FAIL: TestAccSageMakerModelQualityJobDefinition_endpoint (225.24s)
^CFAIL	github.com/hashicorp/terraform-provider-aws/internal/service/sagemaker	261.873s
make: *** [testacc] Error 1`